BusinessProcesses/ПоставкаТовараНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<BusinessProcess>
		<Properties>
			<Name>ПоставкаТовараНаСклад</Name>
			<Task>Task.ЗадачиПоставкиНаСклад</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаДокументаПоставки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступленияНаСклад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварДоставлен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаличиеТовараНаСкладе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

BusinessProcesses/ПоставкаТовараНаСклад/Ext/ObjectModule.bsl
Процедура СтартПередСтартом(ТочкаМаршрутаБизнесПроцесса, Отказ)
	ТоварДоставлен=Ложь;
	
КонецПроцедуры


Процедура ЗаполнитьДокументПоставкиНаСкладПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры


Процедура РазгрузитьТоварПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ТоварДоставлен=Истина;
КонецПроцедуры

Процедура ОпределитьСкладПоставкиПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Сообщить("Не выполнены действия, необходимые для выполнения задачи!", СтатусСообщения.Важное);
   	 	Отказ = Истина;
	Иначе
		// Обнавляем данные документа
		ДокументПоставкиНаСклад=СсылкаДокументаПоставки.ПолучитьОбъект();
		ДокументПоставкиНаСклад.Склад=Склад;
		ДокументПоставкиНаСклад.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;

КонецПроцедуры

Процедура ПровестиДокументПоставкиНаСкладОбработка(ТочкаМаршрутаБизнесПроцесса)
	ДокументПоставкиНаСклад=СсылкаДокументаПоставки.ПолучитьОбъект();
	ДокументПоставкиНаСклад.ДатаПоставки=ТекущаяДата();
	ДокументПоставкиНаСклад.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры
